{"1":"Our very first POW! Give this one a crack and you might win $x$ amount of\r\ndollars where $x \\in (0, \\infty)$ :D\r\n\r\n# Problem\r\nYou want to transport 3000 bananas across 1000 kilometers.\r\nAiding you on your task is a camel that can carry 1000 bananas at most. However,\r\nthe camel must eat 1 banana for each kilometer that it walks.\\\r\n**What is the largest number of bananas that can be transported?**\r\n\r\n# Solution\r\nHello my lovely bananas!\r\n\r\nWe saw a number of great solutions for our first problem of\r\nthe week. Except we gave you two weeks to solve it. Problem\r\nof the fortnight? Anyways, thank you all for participating!\r\n\r\nIn lieu of the extra 168 hours given, we have two winners for\r\nthis one… **Diminutive Rex** and **tendstofortytwo**, congratulations! \r\nWe hope you like your complementary camel-keychain\r\nprize. Alternatively, you can opt for a gift card. Coincidentally,\r\nthey have the same monetary value.\r\nFor those wondering what the solution is, click the spoiler text below.\r\n\r\n!!The camel can transport exactly $533 \\frac{1}{3}$ bananas (roughly $17%$ of the total)\r\nas follows: \\ \r\nTo transport all the bananas $1$ km from the start, we\r\nhave to make $3$ round trips, costing $5$ bananas in total (since\r\nwe don’t go back the last time). After $200$ km, something\r\nimportant happens — the camel has eaten $1000$ bananas! Now\r\nwe only need to make 1 round trip for each km, so that’s $3$\r\nbananas per km. This can go on for $333 \\frac{1}{3}$ km, before another\r\n$1000$ bananas gets eaten. From here, we only need to travel\r\nthe remaining $466 \\frac{2}{3}$ km, at $1$ banana per km, leaving us with a\r\ntotal of $533 \\frac{1}{3}$ bananas at the finish line!!!\r\n\r\nNow, for the winners' approaches:\r\n\r\n## tendstofortytwo's Solution\r\n\r\n!!Tendstofortytwo’s solution, or rather — *computer assisted thought experiment* \r\n— was particularly interesting; they graphed the distance travelled in one go ($x$) versus total\r\nbananas transported ($y$), using a nifty Javascript program to\r\ncalculate all the values. Being hindered by the finiteness of\r\ncomputing power, they arrived at the somewhat approximated answer that it is (about) optimal to travel in 1 km\r\nintervals.  I urge you to check out their results which you can find in this \r\n[spreadsheet](https://docs.google.com/spreadsheets/d/1QIgi6lQ1lr8cJNkslepUWyw6S6Rcbq3LQP-4L2JGvM/edit?usp=sharing.) \r\nand ponder about the zigzaggy corners.!!\r\n\r\n## Diminutive Rex's Solution\r\n\r\n!!Diminutive Rex came up with a more rigorous proof, ~~showing once again that computers are inferior to pencil and paper in every way~~. \r\nTheir method of transporting bananas involved setting up “banana caches” throughout the journey, such that\r\nthey would end up back at the start and be able to travel the whole $1000$km in one go, \r\npicking up the caches as they go.!!\r\n\r\nHere is is a shortened version of their proof:\r\n\r\n!!Clearly, you must leave banana caches to get ANY bananas\r\npast the finish line, and, clearly, you must make at least two\r\ntrips back to the origin to pick up more bananas, if you are\r\ngoing to make the most of your bananas. The sum of all\r\nbananas in banana caches up to and including kilometre $x$\r\nshould be no more than $x$. This is because if, for example,\r\nyou encounter $400$ bananas at the $200$km mark on your final\r\ntrip, you will have to leave $200$ bananas behind—a waste of\r\nbananas! And after arguing that $2$ banana caches are necessary\r\nto transport the maximum number of bananas because two\r\ntrips back to the origin are needed, they concluded “without\r\nloss of generality that one of the caches will have to be further\r\nout than the other. That means that, when leaving the caches,\r\nwe will travel the distance from the origin to the closer cache\r\n$4$ times, but the distance from the closer cache to the further\r\ncache just $2$ times. This means that the further cache can store\r\nat most $\\frac{1}{3}$ of a trip’s worth of bananas, and the closer cache\r\ncan store at most 1/5 (two trips there, two trips back, and the\r\namount cached). $\\frac{1}{3}(1000) + \\frac{1}{5}(1000) = 533$ bananas!!!\r\n\r\n# Bonus: tendstofortytwo's Winning Speech\r\n\r\nFinally, tendstofortytwo ~~harassed me for three days~~ *insisted* I include their\r\nwinning speech in this article, so bear with me:\r\n\r\n“Today, I stand before you ladies, gentlemen, and formulae of\r\nthe Pure Math Club, because you bestow upon me the honor\r\nof ‘Grand Optimizer of Camel Fuel Efficiency’. I could not\r\nbe more deeply honored to receive this prize, this token of\r\nappreciation from the community of mathematics. As a child,\r\nI never thought I would be counted among the greats—Isaac\r\nNewton, Carl Gauss, Matt Parker, Three B. O. Brown, Presh\r\nTalwalker, and now me. It seemed like a mere fantasy, a\r\ndream that would stay forever unrealized. I am glad not only\r\nthat I was able to solve this problem and bring out many\r\npositive changes in this world, including but not limited to\r\nworld peace and the end of global warming, but also that you\r\ngave me the opportunity to do this. If not for the support of\r\nthe Pure Math Club, I would be as lost as a first year in the\r\nhallways of the engineering buildings (because frankly, unlike\r\nMC and DC they’re an organizational mess). I thank you all for\r\nyour unending support in this endeavor, and I shall cherish\r\nthis camel as a memento from the world to me, of my mark\r\nmade on the human species. Thank you.”","2":"Hey folks!\r\n\r\nWelcome back. Did I subconsciously choose this problem\r\nbecause I’m behind on all my work and I was rushing to scrape\r\nsomething together for this issue, you ask? Great question.\r\nLet’s take a look at this week’s problem.\r\n\r\n# Problem\r\n\r\nCan you divide a watch face into 6 parts with straight lines\r\nso that each part contains 2 numbers and the six sums of 2\r\nnumbers are equal?\r\n\r\nA clock face is provided above as a reference, \r\nin case you don't know what a watch looks like :p\r\n\r\n# Solution\r\n\r\n<details><summary>This one was pretty simple as they say, a picture is worth a thousand words...</summary>\r\n\r\n\r\n![clock_solution](pic.png)\r\n</details>\r\n\r\n# Additional Notes\r\nTaken from *The Moscow Puzzles: 359 Mathematical Recreations* by\r\nBoris A. Kordemsky, edited by Martin Gardner, (pg. 11):","3":"\r\nHello hello! 'Nuff said, new POW, so there's new prizes to be won.\r\n\r\n(the true prize being the elusive mathematical \"maturity\" we all crave)\r\n\r\nLet's all pretend like I didn't screw this one up and send a wrong picture in the email, mkay? Thanks xoxo\r\n\r\n# Problem\r\n\r\nThe squares of a chessboard are numbered as shown. Eight numbers are\r\nrandomly chosen sothere is one in each row and each column.\r\n\r\nShow the sum of these numbers is always the same. What is the sum for an\r\n$n \\times n$ board?\r\n\r\n# Solution\r\n\r\n!!Solution would go here.!!\r\n\r\n# Additional Notes\r\n\r\nTaken from *Problemas azanzados*, by Anne Alberro Semerena, Radmila Bulajich Manfrino,\r\nand Carlos Jacob Barrios (pg.1).\r\n","4":"Worked pretty hard on this sexy little puzzle 💃 (ie. there wasn't an \"answer at the back of the book\" that I could look up this week), so be sure to give this one a try...\r\n\r\nTry it, if not for the prizes, but for the eternal glory of claiming a piece of mathematical history ✨!\r\n\r\n# Background\r\n\r\nChoose any natural number. If it's even, divide it by two. If it's odd, \r\nmultiply it by three and add one. Iterate this process over and over again.\r\n\r\nThe **Collatz Conjecture** hypothesizes that this process reaches 1 after only a finite number\r\nof iterations (and then cycles through 1, 4, 2, 1, 4, 2, 1 etc). Interestingly, this is only a conjecture -\r\ndespite our advancements in modern mathematics, no one has been able to definitively prove whether this is true,\r\nor find a counterexample, despite the simplicity of this problem.\r\n\r\nDon't worry - we won't ask you to prove the conjecture here, but we will do something similar.\r\n\r\n# Problem: the \"DIY\" conjecture\r\n\r\nThis week, we want you to find a rule that is sort of like the Collatz rule, but\r\nbased on divisibility by a number other than 2.\r\n\r\nFormally, for some $k > 2$, we can define a Collatz rule by their general form\r\n- $kn \\rightarrow n$;\r\n- $kn + 1 \\rightarrow \\text{multiply and add something to (kn+1)}$;\r\n- $kn + 2 \\rightarrow \\text{multiply and add something to (kn+2)}$,\r\nand so on.\r\n\r\nIn other words, create a \"Linear Collatzian\" rule of size $k > 2$ that reaches 1 in\r\na finite number of steps (for like the first 500 numbers).\r\n\r\n# Bonuses (wait, there's more??)\r\n\r\n## Bonus\r\nFind more than one rule!\r\n\r\n## Extra Bonus\r\nWrite a program that finds and checks rules!\r\n\r\n## Super Bonus\r\nFind a (non trivial) way of generating a family of rules!\r\n\r\n## MEGA Bonus\r\nWhich rules only have one cycle? Which ones have a few cycles? Do some of them have\r\na finite or infinite number of cycles?\r\n\r\n## EPICC Bonus\r\nWhat makes a rule more likely to reach 1 for more numbers? What makes it more likely to have longer\r\n(though still finite) sequences before reaching 1? Why?","5":"\r\nHey math-folk!\r\n\r\nLet's switch gears this fortnight to the study of secrecy\r\nand intelligence; in other words, CRYPTOGRAPHY and\r\nBenebottom Cucumber's razor sharp cheekbones.\r\n\r\nTo be honest, these problems are my only motivation to keep\r\ndoing math while my soul gets sucked out during co-op, so\r\nthe themes tend to stick to whatever I'm reading that week.\r\nSo thank you to everyone who's been keeping up with this\r\nhalf-blog, half-POW (get it? because it's once every two weeks\r\n:3) train ride.\r\n\r\nThis week, I've got a fun teaser that no mathlete lesser than\r\nAlan Turing himself could solve… at least, so far. Try your luck! \r\n\r\n# Problem\r\nDecipher the following message:\r\n```\r\ncaesar\r\nYLJHQHUH\r\nWMGPR, WVGJVJ\r\n84 44 67 48 58 25\r\nOIE XUPV RNS?\r\n```\r\n\r\n# Hints:\r\n1. !!The cipher name tells you the cipher key!!\r\n2. !!Google is encouraged!!\r\n3. !!www.101computing.net is helpful for the last line!!\r\n\r\n# Solution\r\n!!Solution would go here!!\r\n\r\n# Additional Notes\r\nInspired by *The Code Book*, by Simon Singh."}