{"1":"Our very first POW! Give this one a crack and you might win $x$ amount of\r\ndollars, where $x \\in (0, \\infty)$ :D\r\n\r\n# Problem\r\nYou want to transport 3000 bananas across 1000 kilometers.\r\nAiding you on your task is a camel that can carry 1000 bananas at most. However,\r\nthe camel must eat 1 banana for each kilometer that it walks.\\\r\n**What is the largest number of bananas that can be transported?**\r\n\r\n# Solution\r\n!!The solution to the problem would go here.!!\r\n","2":"\r\nHey folks!\r\n\r\nWelcome back. Did I subconsciously choose this problem\r\nbecause I’m behind on all my work and I was rushing to scrape\r\nsomething together for this issue, you ask? Great question.\r\nLet’s take a look at this week’s problem.\r\n\r\n# Problem\r\n\r\nCan you divide a watch face into 6 parts with straight lines\r\nso that each part contains 2 numbers and the six sums of 2\r\nnumbers are equal?\r\n\r\nA clock face is provided above as a reference, \r\nin case you don't know what a watch looks like :p\r\n\r\n# Solution\r\n\r\n!!Solution would go here.!!\r\n\r\n# Additional Notes\r\nTaken from *The Moscow Puzzles: 359 Mathematical Recreations* by\r\nBoris A. Kordemsky, edited by Martin Gardner, (pg. 11):","3":"\nHello hello! 'Nuff said, new POW, so there's new prizes to be won.\n\n(the true prize being the elusive mathematical \"maturity\" we all crave)\n\nLet's all pretend like I didn't screw this one up and send a wrong picture in the email, mkay? Thanks xoxo\n\n# Problem\n\nThe squares of a chessboard are numbered as shown. Eight numbers are\nrandomly chosen sothere is one in each row and each column.\n\nShow the sum of these numbers is always the same. What is the sum for an\n$n \\times n$ board?\n\n# Solution\n\n!!Solution would go here.!!\n\n# Additional Notes\n\nTaken from *Problemas azanzados*, by Anne Alberro Semerena, Radmila Bulajich Manfrino,\nand Carlos Jacob Barrios (pg.1).\n","4":"Worked pretty hard on this sexy little puzzle 💃 (ie. there wasn't an \"answer at the back of the book\" that I could look up this week), so be sure to give this one a try...\n\nTry it, if not for the prizes, but for the eternal glory of claiming a piece of mathematical history ✨!\n\n# Background\n\nChoose any natural number. If it's even, divide it by two. If it's odd, \nmultiply it by three and add one. Iterate this process over and over again.\n\nThe **Collatz Conjecture** hypothesizes that this process reaches 1 after only a finite number\nof iterations (and then cycles through 1, 4, 2, 1, 4, 2, 1 etc). Interestingly, this is only a conjecture -\ndespite our advancements in modern mathematics, no one has been able to definitively prove whether this is true,\nor find a counterexample, despite the simplicity of this problem.\n\nDon't worry - we won't ask you to prove the conjecture here, but we will do something similar.\n\n# Problem: the \"DIY\" conjecture\n\nThis week, we want you to find a rule that is sort of like the Collatz rule, but\nbased on divisibility by a number other than 2.\n\nFormally, for some $k > 2$, we can define a Collatz rule by their general form\n- $kn \\rightarrow n$;\n- $kn + 1 \\rightarrow \\text{multiply and add something to (kn+1)}$;\n- $kn + 2 \\rightarrow \\text{multiply and add something to (kn+2)}$,\nand so on.\n\nIn other words, create a \"Linear Collatzian\" rule of size $k > 2$ that reaches 1 in\na finite number of steps (for like the first 500 numbers).\n\n# Bonuses (wait, there's more??)\n\n## Bonus\nFind more than one rule!\n\n## Extra Bonus\nWrite a program that finds and checks rules!\n\n## Super Bonus\nFind a (non trivial) way of generating a family of rules!\n\n## MEGA Bonus\nWhich rules only have one cycle? Which ones have a few cycles? Do some of them have\na finite or infinite number of cycles?\n\n## EPICC Bonus\nWhat makes a rule more likely to reach 1 for more numbers? What makes it more likely to have longer\n(though still finite) sequences before reaching 1? Why?","5":"\nHey math-folk!\n\nLet's switch gears this fortnight to the study of secrecy\nand intelligence; in other words, CRYPTOGRAPHY and\nBenebottom Cucumber's razor sharp cheekbones.\n\nTo be honest, these problems are my only motivation to keep\ndoing math while my soul gets sucked out during co-op, so\nthe themes tend to stick to whatever I'm reading that week.\nSo thank you to everyone who's been keeping up with this\nhalf-blog, half-POW (get it? because it's once every two weeks\n:3) train ride.\n\nThis week, I've got a fun teaser that no mathlete lesser than\nAlan Turing himself could solve… at least, so far. Try your luck! \n\n# Problem\nDecipher the following message:\n```\ncaesar\nYLJHQHUH\nWMGPR, WVGJVJ\n84 44 67 48 58 25\nOIE XUPV RNS?\n```\n\n# Hints:\n1. !!The cipher name tells you the cipher key!!\n2. !!Google is encouraged!!\n3. !!www.101computing.net is helpful for the last line!!\n\n# Solution\n!!Solution would go here!!\n\n# Additional Notes\nInspired by *The Code Book*, by Simon Singh."}